Repository: gfarida/financetracker
Catalog: messages/*/LC_MESSAGES/messages.po
Languages: ru

source: Please register first using the /start command.
ru: Сначала зарегистрируйтесь с помощью команды /start.

source: Budget set: {} for category {}
ru: Установлен бюджет: {} для категории {}

source: Usage: /set_budget <category> <amount>
ru: Использование: /set_budget <категория> <сумма>

source: Usage: /delete_budget <category>
ru: Использование: /delete_budget <категория>

source: Budget for category {} deleted! Budget set to infinity.
ru: Бюджет для категории {} удален! Бюджет установлен в бесконечность.

source: Budget for category {} not found.
ru: Бюджет для категории {} не найден.

source: An error occurred while deleting the budget.
ru: Произошла ошибка при удалении бюджета.

source: You have no set budgets.
ru: У вас нет установленных бюджетов.

source: Category: *{}* - Budget: *{}.* Spent: *{:.2f}% * ({} / {})
ru: Категория: *{}* - Бюджет: *{}.* Израсходовано: *{:.2f}% * ({} / {})

source: An error occurred while retrieving budgets.
ru: Произошла ошибка при получении бюджетов.

source: There are no expenses for the current period
ru: За текущий период расходов нет

source: Financial analysis from *{} {}* to *{} {}*:
ru: Финансовый анализ с *{} {}* по *{} {}*:

source: *Total expenses*: {}
ru: *Общие расходы*: {}

source: Expenses by category:
ru: Расходы по категориям:

source: Expenses by category
ru: Расходы по категориям

source: Please use the format: /financial_analysis <start_date> <start_time> <end_date> <end_time>. Date and time format: YYYY-MM-DD HH:MM:SS
ru: Пожалуйста, используйте формат: /financial_analysis <start_date> <start_time> <end_date> <end_time>. Формат даты и времени: ГГГГ-ММ-ДД ЧЧ:ММ:СС

source: An error occurred during the analysis.
ru: Произошла ошибка при выполнении анализа.

source: Please use the format: /add <amount> <description>
ru: Пожалуйста, используйте формат: /add <сумма> <описание>

source: Attention! Budget for category *{}* exceeded! Set budget: *{}*, current budget: *{}*
ru: Внимание! Бюджет для категории *{}* превышен! Установленный бюджет: *{}*, текущий бюджет: *{}*

source: Expense added: {} for {} in category *{}* You have spent *{:.2f}% ({}/{})* of the budget allocated for category *{}*
ru: Трата добавлена: {} на {} в категорию *{}* Вы израсходовали *{:.2f}% ({}/{})* бюджета, выделенного на категорию *{}*

source: You have no expenses yet.
ru: У вас пока нет трат.

source: Date: *{}*, expense: *{}*, category: *{}*, ID: *{}*
ru: Дата: *{}*, трата: *{}*, категория: *{}*, ID: *{}*

source: Your expenses: {}
ru: Ваши траты: {}

source: An error occurred while displaying expenses.
ru: Произошла ошибка при отображении трат.

source: Please use the format: /delete <expense ID>
ru: Пожалуйста, используйте формат: /delete <id траты>

source: Please enter a valid expense ID.
ru: Пожалуйста, введите правильный ID траты.

source: User not found.
ru: Пользователь не найден.

source: Expense not found.
ru: Трата не найдена.

source: Expense with ID {} successfully deleted!
ru: Трата с ID {} успешно удалена!

source: Available commands: /start - Register /add <amount> <description> - Add an expense /set_budget <category> <amount> - Set a budget for a category /delete_budget <category> - Delete the set budget for a category /show_budgets - Show all set budgets /show - Show all added expenses /delete <id> - Delete an expense by ID /analysis <start_date> <start_time> <end_date> <end_time>. Date and time format: YYYY-MM-DD HH:MM:SS /help - Show this message
ru: Доступные команды: /start - Зарегистрироваться /add <сумма> <описание> - Добавить трату /set_budget <категория> <сумма> - Установить бюджет для категории /delete_budget <категория> - Удалить установленный бюджет для категории /show_budgets - Показать все установленные бюджеты /show - Показать все добавленные траты /delete <id> - Удалить трату по ID /analysis <start_date> <start_time> <end_date> <end_time>. Формат даты и времени: ГГГГ-ММ-ДД ЧЧ:ММ:СС /help - Показать это сообщение

source: Hello! I am a finance management bot. You have successfully registered.
ru: Привет! Я бот для управления финансами. Вы успешно зарегистрированы.

source: Hello! You are already registered.
ru: Привет! Вы уже зарегистрированы.

source: Groceries
ru: Продукты

source: Rent
ru: Аренда

source: Utilities
ru: Коммунальные услуги

source: Transportation
ru: Транспорт

source: Dining
ru: Питание

source: Entertainment
ru: Развлечения

source: Health
ru: Здоровье

source: Education
ru: Образование

source: Clothing
ru: Одежда

source: Other
ru: Другое

source: Which of the following categories does the expense '{}' belong to? {}. User may answer in any language. Answer with one word - the name of the category in English. If you don't know answer Other. Please do not add punctuation or any other signs to your response.
ru: К какой из следующих категорий относится трата '{}'? {}. Пользователь может ответить на любом языке. Ответь одним словом - название категории на русском языке. Если не знаешь, ответь Другое. Пожалуйста не добавляй пунктуацию или другие знаки к ответу.
